"""
문제 설명
sizes에는 진열된 바지 사이즈의 목록이 들어 있습니다. 다음 코드는 사이즈가 32인 바지의 위치를 모두 출력하고 있는데요. 5번째줄을 수정해서 사이즈가 32인 바지의 위치를 한 번만 출력하고 프로그램이 종료되도록 만들어 보세요.

32인 바지의 위치를 한번만 출력하고 반복문을 빠져나와야 합니다. break는 반복문을 종료시키는 기능을 갖고 있으므로 break를 이용하면 되겠지요.

아래의 예제는 list에서 3의 배수를 하나만 찾고 반복문을 종료하는 코드입니다. 이 예제를 참고하여 문제를 해결해 보세요.

list = [1, 2, 3, 5, 7, 2, 5, 237, 55]
for val in list:
    if val % 3 == 0:
        print(val)
        break
"""

sizes = [33,35,34,37,32,35,39,32,35,29]
for i,size in enumerate(sizes):
    if size == 32:
        print("사이즈 32인 바지는 {}번째에 있다.".format(i+1))
        # 여기에 코드를 추가하세요
        break