"""
문제 설명
다음 코드는 numbers에 있는 튜플을 받아들여서 튜플의 첫번째 숫자를 두번째 숫자로 나누는 일을 합니다. 이 때, b가 0이면 "0으로 나눌 수는 없습니다."라고 출력하는데요. 이 if else문에서 continue문을 이용하여 else를 사용하지 않도록 변경해 보세요.

할 일
주어진 if-else문에서 else문을 제거하고 if문과 continue를 사용하기
실행 시 다음 문장이 출력되도록 만들기
출력되어야 하는 문장:

1를 2로 나누면 0.5
0으로 나눌 수는 없습니다.
continue는 반복문의 나머지 부분을 보지 않고, 반복문의 처음으로 돌아가는 기능입니다. continue는 핵심이 되는 블럭이 너무 들여쓰기 되지 않게 합니다.

아래의 예제는 10 이하의 홀수만 출력하는 코드입니다. 아래의 예를 참고하여 문제를 해결해 보세요.

for i in range(10):
    if i % 2 ==0:
        continue
    print(i)
"""

