"""
문제 설명
slice로 리스트를 수정하는 방법을 알아봅시다. 주석에 적힌 지시에 따라 코드를 작성해 보세요.

slice로 리스트를 수정하는 방법은 아래와 같습니다.

list1 = list(range(10))      # [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

del list[:5]                 # 처음부터 5번째까지 삭제          [6, 7, 8, 9]

list[1:3] = [77, 88]         # 1번째부터 3번째까지의 값을 수정   [6, 77, 88, 9]
list[1:3] = [77, 88, 99]     # 더 많은 개수로 변환              [6, 77, 88, 99, 9]
list[1:4] = [8]              # 더 적은 개수로 변환  
"""

list1 = [0, 1, 2, 3, 4, 5]
# list1의 1부터 3까지를 slice를 이용해서 각각 11, 22, 33으로 바꿔보세요.
# 바꾸고 나면 list1은 [0, 11, 22, 33, 4, 5]가 되어야 합니다.

list1[1:4] = [11, 22, 33] 


list2 = [0, 1, 2, 3, 4, 5]
# list2의 1부터 3까지를 del과 slice를 이용해서 지워보세요
# 바꾸고 나면 list2은 [0, 4, 5]가 되어야 합니다.

del list2[1:4]

print("list1 : {}, list2 : {}".format(list1, list2))