"""
문제 설명
if문은 이어서 나오는 조건식이 참이면 그 아래줄에 들여쓰기한 코드가 실행됩니다. if의 조건식에는 대소비교 뿐만 아니라 True/False값 또한 사용할 수 있습니다. 코드를 실행해서 어떤 결과가 나오는지 확인해보세요.

예를 들어,

조건식에 대소비교가 쓰인 경우
if 3<5:
    print("조건식이 True이므로 실행됩니다.")
if 3>5:
    print("조건식이 False이므로 실행되지 않습니다.")   
위의 예처럼 3은 5보다 작으므로 3<5가 참인 if문만 실행됩니다.

조건식에 True/False가 쓰인 경우
if True:
    print("조건식이 True이므로 실행됩니다.")
if False:
    print("조건식이 False이므로 실행되지 않습니다.")
조건문이 참인 True의 if문만 실행됩니다.
"""

if True:
    print("조건식이 True이면 실행됩니다.")

if False:
    print("조건식이 False이면 실행되지 않습니다.")