"""
문제 설명
다음 코드는 변수 hour에 현재 시간을 저장합니다. hour에 저장된 현재 시간이 12보다 작을때만 코드8번째줄의 print문이 실행되도록 코드7번째줄에 if문을 추가하세요.

조건식을 작성하는 문제입니다. 조건식의 숫자를 비교하여 참거짓을 판별하는 예를 살펴보세요.

크다, 작다
<, >(부등호)를 이용합니다.
크거나 같다, 작거나 같다
<=, >=(부등호-등호)를 이용합니다. 이 때, =<, =>(등호-부등호)순은 동작하지 않습니다.
같다
==(등호2개)를 이용합니다. =(등호1개)는 대입을 위한 기호입니다.
같지 않다
!=(느낌표-등호)를 이용합니다.
"""

#아래 두 줄의 코드는 변수 hour에 현재 시간을 저장합니다.
#이 코드가 어떻게 동작하는지는 이후 강의에서 다룹니다.
from datetime import datetime 
hour = datetime.now().hour

#현재 시간이 12시보다 작을때만 print문을 실행하도록 이 아래줄에 if문을 추가하세요.
if hour < 12:
    print('오전입니다.')#if문을 추가한 이후 이 줄은 들여쓰기 되어야 합니다.
# else:
#     print('오후입니다.')