"""
문제 설명
월을 이름표로 가지고, 그 달에 있는 날짜 수를 값으로 가지는 딕셔너리를 만들어서 days_in_month에 저장해 보세요.

월은 '1월','2월'과 같은 형식으로 저장하면 됩니다. 예를 들어 days_in_month['1월']하면 그 값은 31이어야 합니다.1
3월까지만 값을 넣어 보세요.
1월은 31일, 2월은 28일, 3월은 31일까지만 있다고 가정하세요.
딕셔너리를 만들는 방법에 대해 알아보세요.
딕셔너리란 여러 값을 저장해 두고 필요한 값을 꺼내 쓰는 기능입니다. 이름표를 아용하여 값을 꺼내 사용하며, 리스트와 비슷한 방식을 갖습니다.

wintable = {
    '가위' : '보',
    '바위' : '가위',
    '보' : '바위'   
}

print(wintable['가위'])    #'보'가 출력됩니다.
"""

days_in_month = {
    #여기에 코드를 완성해 보세요.
    '1월' : 31,
    '2월' : 28,
    '3월' : 31
  
 }

print(days_in_month['1월'])